# MaxPipeSizeReached Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..PipingFailures..::..MaxPipeSizeReached Property
BuiltInFailures..::..PipingFailures Class See Also
---
Maximum pipe size diameter reached during sizing
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId MaxPipeSizeReached { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MaxPipeSizeReached As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ MaxPipeSizeReached {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..PipingFailures Class
Autodesk.Revit.DB Namespace